app/controllers/exercises_controller.rb

SELECT  "exercises".* FROM "exercises"  WHERE (1897) LIMIT 1
---
  def index
    @exercises = Exercise.all

INSERT INTO "exercises" ("bench", "created_at", "deadlift", "overhead_press", "squat", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["bench", 190], ["created_at", "2015-11-06 18:21:29.325073"], ["deadlift", 340], ["overhead_press", 100], ["squat", 200], ["updated_at", "2015-11-06 18:21:29.325073"]]
UPDATE "users" SET "template_chosen" = $1, "updated_at" = $2 WHERE "users"."id" = 1  [["template_chosen", "t"], ["updated_at", "2015-11-06 21:54:19.288127"]]
---
  def create
    if !current_user
      redirect_to users_path, alert: "Log in first!"
    else
      @exercise = Exercise.new(exercise_params)
      @exercise.user_id = current_user.id
      @exercise.save!

      current_user.update_attributes(template_chosen: true)