app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "goal", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.save